Repository: liyishibeck-ctrl/Buddhist_Text_Analysis_Platform
Catalog: data/raw/tibetan/84000/data-translation-memory-master/toh9-v3.tmx
Source language: bo
Languages: en

source: ཚེ་དང་ལྡན་པ་རབ་འབྱོར་གང་ལ་འདུ་བ་ལས་བྱུང་བའི་ངོ་བོ་ཉིད་མེད་པ་ཡིན།
en: The venerable Śāradvatīputra then asked, “Venerable Subhūti, with respect to what is there no such thing as an essential nature of something arising from the conjuction of causes?”

source: སྨྲས་པ། གཟུགས་ལ་འདུ་བ་ལས་བྱུང་བའི་ངོ་བོ་ཉིད་མེད་དོ།
en: He replied, “With respect to physical forms, there is no such thing as an essential nature arising from the conjuction of causes.

source: །ཚོར་བ་དང་འདུ་ཤེས་དང་འདུ་བྱེད་དང་། རྣམ་པར་ཤེས་པ་ལ་འདུ་བ་ལས་བྱུང་བའི་ངོ་བོ་ཉིད་མེད་དོ།
en: With respect to feelings, perceptions, formative predispositions, and consciousness, there is no such thing as an essential nature arising from the conjuction of causes.

source: །ཚེ་དང་ལྡན་པ་ཤ་ར་དྭ་ཏིའི་བུ་མིག་ལ་འདུ་བ་ལས་བྱུང་བའི་ངོ་བོ་ཉིད་མེད་དོ།
en: Venerable Śāradvatīputra, with respect to the eyes, there is no such thing as an essential nature arising from the conjuction of causes.

source: །རྣ་བ་དང་སྣ་དང་ལྕེ་དང་ལུས་དང་། ཡིད་ལ་འདུ་བ་ལས་བྱུང་བའི་ངོ་བོ་ཉིད་མེད་དོ།
en: With respect to the ears, nose, tongue, body, and mental faculty, there is no such thing as an essential nature arising from the conjuction of causes.

source: །གཟུགས་ལ་འདུ་བ་ལས་བྱུང་བའི་ངོ་བོ་ཉིད་མེད་དོ།
en: With respect to sights, there is no such thing as an essential nature arising from the conjuction of causes.

source: །སྒྲ་དང་དྲི་དང་རོ་དང་རེག་དང་། ཆོས་ལ་འདུ་བ་ལས་བྱུང་བའི་ངོ་བོ་ཉིད་མེད་དོ།
en: With respect to sounds, odors, tastes, tangibles, and mental phenomena, there is no such thing as an essential nature arising from the conjuction of causes.

source: །མིག་གི་རྣམ་པར་ཤེས་པ་ལ་འདུ་བ་ལས་བྱུང་བའི་ངོ་བོ་ཉིད་མེད་དོ།
en: With respect to visual consciousness, there is no such thing as an essential nature arising from the conjuction of causes.

source: །རྣ་བའི་རྣམ་པར་ཤེས་པ་དང་། སྣའི་རྣམ་པར་ཤེས་པ་དང་། ལྕེའི་རྣམ་པར་ཤེས་པ་དང་། ལུས་ཀྱི་རྣམ་པར་ཤེས་པ་དང་། ཡིད་ཀྱི་རྣམ་པར་ཤེས་པ་ལ་འདུ་བ་ལས་བྱུང་བའི་ངོ་བོ་ཉིད་མེད་དོ།
en: With respect to auditory consciousness, olfactory consciousness, gustatory consciousness, tactile consciousness, and mental consciousness, there is no such thing as an essential nature arising from the conjuction of causes. “

source: །མིག་གི་འདུས་ཏེ་རེག་པ་ལ་འདུ་བ་ལས་བྱུང་བའི་ངོ་བོ་ཉིད་མེད་དོ།
en: With respect to visually compounded sensory contact, there is no such thing as an essential nature arising from the conjuction of causes.

source: །རྣ་བའི་འདུས་ཏེ་རེག་པ་དང་། སྣའི་འདུས་ཏེ་རེག་པ་དང་། ལྕེའི་འདུས་ཏེ་རེག་པ་དང་། ལུས་ཀྱི་འདུས་ཏེ་རེག་པ་དང་། ཡིད་ཀྱི་འདུས་ཏེ་རེག་པ་ལ་འདུ་བ་ལས་བྱུང་བའི་ངོ་བོ་ཉིད་མེད་དོ།
en: With respect to aurally compounded sensory contact, nasally compounded sensory contact, lingually compounded sensory contact, corporeally compounded sensory contact, and mentally compounded sensory contact, there is no such thing as an essential nature arising from the conjuction of causes.

source: །མིག་གི་འདུས་ཏེ་རེག་པ་ལས་བྱུང་བའི་ཚོར་བ་ལ་འདུ་བ་ལས་བྱུང་བའི་ངོ་བོ་ཉིད་མེད་དོ།
en: With respect to feelings arising from sensory contact that is visually compounded, there is no such thing as an essential nature arising from the conjuction of causes.

source: །རྣ་བའི་འདུས་ཏེ་རེག་པ་ལས་བྱུང་བའི་ཚོར་བ་དང་། སྣའི་འདུས་ཏེ་རེག་པ་ལས་བྱུང་བའི་ཚོར་བ་དང་། ལྕེའི་འདུས་ཏེ་རེག་པ་ལས་བྱུང་བའི་ཚོར་བ་དང་། ལུས་ཀྱི་འདུས་ཏེ་རེག་པ་ལས་བྱུང་བའི་ཚོར་བ་དང་། ཡིད་ཀྱི་འདུས་ཏེ་རེག་པ་ལས་བྱུང་བའི་ཚོར་བ་ལ་འདུ་བ་ལས་བྱུང་བའི་ངོ་བོ་ཉིད་མེད་དོ།
en: With respect to feelings arising from sensory contact that is aurally compounded, feelings arising from sensory contact that is nasally compounded, feelings arising from sensory contact that is lingually compounded, feelings arising from sensory contact that is corporeally compounded, and feelings arising from sensory contact that is mentally compounded, there is no such thing as an essential nature arising from the conjuction of causes. “

source: །སའི་ཁམས་ལ་འདུ་བ་ལས་བྱུང་བའི་ངོ་བོ་ཉིད་མེད་དོ།
en: With respect to the earth element, there is no such thing as an essential nature arising from the conjuction of causes.

source: །ཆུའི་ཁམས་དང་། མེའི་ཁམས་དང་། རླུང་གི་ཁམས་དང་། ནམ་མཁའི་ཁམས་དང་། རྣམ་པར་ཤེས་པའི་ཁམས་ལ་འདུ་བ་ལས་བྱུང་བའི་ངོ་བོ་ཉིད་མེད་དོ།
en: With respect to the water element, the fire element, the wind element, the space element, and the consciousness element, there is no such thing as an essential nature arising from the conjuction of causes. “

source: །མ་རིག་པ་ལ་འདུ་བ་ལས་བྱུང་བའི་ངོ་བོ་ཉིད་མེད་དོ།
en: With respect to ignorance, there is no such thing as an essential nature arising from the conjuction of causes.

source: །འདུ་བྱེད་དང་རྣམ་པར་ཤེས་པ་དང་། མིང་དང་གཟུགས་དང་སྐྱེ་མཆེད་དྲུག་དང་། རེག་པ་དང་ཚོར་བ་དང་སྲེད་པ་དང་ལེན་པ་དང་སྲིད་པ་དང་། སྐྱེ་བ་དང་རྒ་ཤི་ལ་འདུ་བ་ལས་བྱུང་བའི་ངོ་བོ་ཉིད་མེད་དོ།
en: With respect to formative predispositions, consciousness, name and form, the six sense fields, sensory contact, sensation, craving, grasping, the rebirth process, actual birth, and aging and death, there is no such thing as an essential nature arising from the conjuction of causes. “

source: །སྦྱིན་པའི་ཕ་རོལ་དུ་ཕྱིན་པ་ལ་འདུ་བ་ལས་བྱུང་བའི་ངོ་བོ་ཉིད་མེད་དོ།
en: With respect to the perfection of generosity, there is no such thing as an essential nature arising from the conjuction of causes.

source: །ཚུལ་ཁྲིམས་ཀྱི་ཕ་རོལ་དུ་ཕྱིན་པ་དང་། བཟོད་པའི་ཕ་རོལ་དུ་ཕྱིན་པ་དང་། བརྩོན་འགྲུས་ཀྱི་ཕ་རོལ་དུ་ཕྱིན་པ་དང་། བསམ་གཏན་གྱི་ཕ་རོལ་དུ་ཕྱིན་པ་དང་། ཤེས་རབ་ཀྱི་ཕ་རོལ་དུ་ཕྱིན་པ་ལ་འདུ་བ་ལས་བྱུང་བའི་ངོ་བོ་ཉིད་མེད་དོ།
en: With respect to the perfection of ethical discipline, the perfection of tolerance, the perfection of perseverance, the perfection of meditative concentration, and the perfection of wisdom, there is no such thing as an essential nature arising from the conjuction of causes. “

source: །ནང་སྟོང་པ་ཉིད་ལ་འདུ་བ་ལས་བྱུང་བའི་ངོ་བོ་ཉིད་མེད་དོ།
en: With respect to the emptiness of internal phenomena, there is no such thing as an essential nature arising from the conjuction of causes.

source: །ཕྱི་སྟོང་པ་ཉིད་ལ་འདུ་བ་ལས་བྱུང་བའི་ངོ་བོ་ཉིད་མེད་དོ།
en: With respect to the emptiness of external phenomena, there is no such thing as an essential nature arising from the conjuction of causes.

source: །ཕྱི་ནང་སྟོང་པ་ཉིད་ལ་འདུ་བ་ལས་བྱུང་བའི་ངོ་བོ་ཉིད་མེད་དོ།
en: With respect to the emptiness of external and internal phenomena, there is no such thing as an essential nature arising from the conjuction of causes.

source: །དངོས་པོ་མེད་པའི་ངོ་བོ་ཉིད་སྟོང་པ་ཉིད་ཀྱི་བར་ལ་འདུ་བ་ལས་བྱུང་བའི་ངོ་བོ་ཉིད་མེད་དོ།
en: With respect to [the other aspects of emptiness], up to and including the emptiness of the essential nature of nonentities, there is no such thing as an essential nature arising from the conjuction of causes. “

source: །དྲན་པ་ཉེ་བར་གཞག་པ་རྣམས་ལ་འདུ་བ་ལས་བྱུང་བའི་ངོ་བོ་ཉིད་མེད་དོ། །ཡང་དག་པར་སྤོང་བ་རྣམས་དང་།
en: With respect to the applications of mindfulness, there is no such thing as an essential nature arising from the conjuction of causes.

source: རྫུ་འཕྲུལ་གྱི་རྐང་པ་རྣམས་དང་། དབང་པོ་རྣམས་དང་། སྟོབས་རྣམས་དང་། བྱང་ཆུབ་ཀྱི་ཡན་ལག་རྣམས་དང་། འཕགས་པའི་ལམ་ཡན་ལག་བརྒྱད་པ་ལ་འདུ་བ་ལས་བྱུང་བའི་ངོ་བོ་ཉིད་མེད་དོ། །འཕགས་པའི་བདེན་པ་རྣམས་དང་། བསམ་གཏན་རྣམས་དང་། ཚད་མེད་པ་རྣམས་དང་། གཟུགས་མེད་པའི་སྙོམས་པར་འཇུག་པ་རྣམས་དང་། རྣམ་པར་ཐར་བ་བརྒྱད་དང་། མཐར་གྱིས་གནས་པའི་སྙོམས་པར་འཇུག་པ་དགུ་དང་། རྣམ་པར་ཐར་པའི་སྒོ་སྟོང་པ་ཉིད་དང་། མཚན་མ་མེད་པ་དང་། སྨོན་པ་མེད་པ་དང་། མངོན་པར་ཤེས་པ་རྣམས་དང་། ཏིང་ངེ་འཛིན་རྣམས་དང་།
en: With respect to the correct exertions, the supports for miraculous ability, the faculties, the powers, the branches of enlightenment, and the noble eightfold path, there is no such thing as an essential nature arising from the conjuction of causes. “

source: གཟུངས་ཀྱི་སྒོ་རྣམས་དང་། དེ་བཞིན་གཤེགས་པའི་སྟོབས་བཅུ་དང་། མི་འཇིགས་པ་བཞི་དང་། སོ་སོ་ཡང་དག་པར་རིག་པ་བཞི་དང་། སངས་རྒྱས་ཀྱི་ཆོས་མ་འདྲེས་པ་རྣམས་ལ་འདུ་བ་ལས་བྱུང་བའི་ངོ་བོ་ཉིད་མེད་དོ།
en: With respect to the truths of the noble ones, the meditative concentrations, the immeasurable attitudes, the formless absorptions, the eight aspects of liberation, the serial steps of meditative absorption, the gateways to liberation—emptiness, signlessness, and wishlessness—the extrasensory powers, the meditative stabilities, the dhāraṇī gateways, the ten powers of the tathāgatas, the four fearlessnesses, the four kinds of exact knowledge, and the eighteen distinct qualities of the buddhas, there is no such thing as an essential nature arising from the conjuction of causes.

source: །དེ་ཅིའི་ཕྱིར་ཞེ་ན། ཚེ་དང་ལྡན་པ་ཤ་ར་དྭ་ཏིའི་བུ་རྣམ་གྲངས་དེས་ན། ཆོས་ཐམས་ཅད་ནི་དངོས་པོ་མེད་པའི་ངོ་བོ་ཉིད་དོ།
en: So if you ask how that is so, Venerable Śāradvatīputra, those are the formulations explaining how all phenomena have the essential nature of being nonentities. “

source: །ཚེ་དང་ལྡན་པ་ཤ་ར་དྭ་ཏིའི་བུ་གཞན་ཡང་ཆོས་ཐམས་ཅད་ནི་མི་རྟག་པ་སྟེ། གང་དང་ཡང་བྲལ་བས་མ་ཡིན་ནོ། །སྨྲས་པ།
en: Moreover, Venerable Śāradvatīputra, all phenomena are impermanent, but that is not owing to the disappearance of anything at all.” “

source: ཚེ་དང་ལྡན་པ་རབ་འབྱོར་ཆོས་ཐམས་ཅད་མི་རྟག་པ་སྟེ། གང་དང་ཡང་བྲལ་བས་མ་ཡིན་པ་དེ་དག་གང་ཡིན།
en: Venerable Subhūti, what are all those phenomena that are impermanent, but are not so owing to the disappearance of anything at all?” “

source: སྨྲས་པ། ཚེ་དང་ལྡན་པ་ཤ་ར་དྭ་ཏིའི་བུ་གཟུགས་མི་རྟག་པ་སྟེ། གང་དང་ཡང་བྲལ་བས་མ་ཡིན་ནོ།
en: Venerable Śāradvatīputra,” he replied, “physical forms are impermanent, but that is not owing to the disappearance of anything at all.

source: །ཚོར་བ་དང་འདུ་ཤེས་དང་འདུ་བྱེད་དང་རྣམ་པར་ཤེས་པ་མི་རྟག་པ་སྟེ། གང་དང་ཡང་བྲལ་བས་མ་ཡིན་ནོ།
en: Feelings, perceptions, formative predispositions, and consciousness are impermanent, but that is not owing to the disappearance of anything at all.

source: །མིག་མི་རྟག་པ་སྟེ། གང་དང་ཡང་བྲལ་བས་མ་ཡིན་ནོ།
en: The eyes are impermanent, but that is not owing to the disappearance of anything at all.

source: །རྣ་བ་དང་སྣ་དང་ལྕེ་དང་ལུས་དང་ཡིད་མི་རྟག་པ་སྟེ། གང་དང་ཡང་བྲལ་བས་མ་ཡིན་ནོ། །གཟུགས་མི་རྟག་པ་སྟེ།
en: The ears, nose, tongue, body, and mental faculty are impermanent, but that is not owing to the disappearance of anything at all.

source: གང་དང་ཡང་བྲལ་བས་མ་ཡིན་ནོ།
en: Sights are impermanent, but that is not owing to the disappearance of anything at all.

source: །སྒྲ་དང་དྲི་དང་རོ་དང་རེག་དང་ཆོས་མི་རྟག་པ་སྟེ། གང་དང་ཡང་བྲལ་བས་མ་ཡིན་ནོ།
en: Sounds, odors, tastes, tangibles, and mental phenomena are impermanent, but that is not owing to the disappearance of anything at all.

source: །མིག་གི་རྣམ་པར་ཤེས་པ་མི་རྟག་པ་སྟེ། གང་དང་ཡང་བྲལ་བས་མ་ཡིན་ནོ། །རྣ་བའི་རྣམ་པར་ཤེས་པ་དང་།
en: Visual consciousness is impermanent, but that is not owing to the disappearance of anything at all.

source: སྣའི་རྣམ་པར་ཤེས་པ་དང་། ལྕེའི་རྣམ་པར་ཤེས་པ་དང་། ལུས་ཀྱི་རྣམ་པར་ཤེས་པ་དང་། ཡིད་ཀྱི་རྣམ་པར་ཤེས་པ་མི་རྟག་པ་སྟེ། གང་དང་ཡང་བྲལ་བས་མ་ཡིན་ནོ།
en: Auditory consciousness, olfactory consciousness, gustatory consciousness, tactile consciousness, and mental consciousness are impermanent, but that is not owing to the disappearance of anything at all.

source: །མིག་གི་འདུས་ཏེ་རེག་པ་མི་རྟག་པ་སྟེ། གང་དང་ཡང་བྲལ་བས་མ་ཡིན་ནོ། །རྣ་བའི་འདུས་ཏེ་རེག་པ་དང་།
en: Visually compounded sensory contact is impermanent, but that is not owing to the disappearance of anything at all.

source: སྣའི་འདུས་ཏེ་རེག་པ་དང་། ལྕེའི་འདུས་ཏེ་རེག་པ་དང་། ལུས་ཀྱི་འདུས་ཏེ་རེག་པ་དང་། ཡིད་ཀྱི་འདུས་ཏེ་རེག་པ་མི་རྟག་པ་སྟེ། གང་དང་ཡང་བྲལ་བས་མ་ཡིན་ནོ།
en: Aurally compounded sensory contact, nasally compounded sensory contact, lingually compounded sensory contact, corporeally compounded sensory contact, and mentally compounded sensory contact are impermanent, but that is not owing to the disappearance of anything at all.

source: །མིག་གི་འདུས་ཏེ་རེག་པའི་རྐྱེན་གྱིས་ཚོར་བ་མི་རྟག་པ་སྟེ། གང་དང་ཡང་བྲལ་བས་མ་ཡིན་ནོ། །རྣ་བའི་འདུས་ཏེ་རེག་པའི་རྐྱེན་གྱིས་ཚོར་བ་དང་།
en: Feelings arising from sensory contact that is visually compounded are impermanent, but that is not owing to the disappearance of anything at all.

source: སྣའི་འདུས་ཏེ་རེག་པའི་རྐྱེན་གྱིས་ཚོར་བ་དང་། ལྕེའི་འདུས་ཏེ་རེག་པའི་རྐྱེན་གྱིས་ཚོར་བ་དང་། ལུས་ཀྱི་འདུས་ཏེ་རེག་པའི་རྐྱེན་གྱིས་ཚོར་བ་དང་། ཡིད་ཀྱི་འདུས་ཏེ་རེག་པའི་རྐྱེན་གྱིས་ཚོར་བ་མི་རྟག་པ་སྟེ། གང་དང་ཡང་བྲལ་བས་མ་ཡིན་ནོ།
en: Feelings arising from sensory contact that is aurally compounded, feelings arising from sensory contact that is nasally compounded, feelings arising from sensory contact that is lingually compounded, feelings arising from sensory contact that is corporeally compounded, and feelings arising from sensory contact that is mentally compounded are impermanent, but that is not owing to the disappearance of anything at all. “

source: །སའི་ཁམས་མི་རྟག་པ་སྟེ། གང་དང་ཡང་བྲལ་བས་མ་ཡིན་ནོ། །ཆུའི་ཁམས་དང་།
en: The earth element is impermanent, but that is not owing to the disappearance of anything at all.

source: མེའི་ཁམས་དང་། རླུང་གི་ཁམས་དང་། ནམ་མཁའི་ཁམས་དང་། རྣམ་པར་ཤེས་པའི་ཁམས་མི་རྟག་པ་སྟེ། གང་དང་ཡང་བྲལ་བས་མ་ཡིན་ནོ།
en: The water element, the fire element, the wind element, the space element, and the consciousness element are impermanent, but that is not owing to the disappearance of anything at all. “

source: །མ་རིག་པ་མི་རྟག་པ་སྟེ། གང་དང་ཡང་བྲལ་བས་མ་ཡིན་ནོ།
en: Fundamental ignorance is impermanent, but that is not owing to the disappearance of anything at all.

source: །འདུ་བྱེད་དང་རྣམ་པར་ཤེས་པ་དང་མིང་དང་གཟུགས་དང་སྐྱེ་མཆེད་དྲུག་དང་རེག་པ་དང་ཚོར་བ་དང་སྲེད་པ་དང་ལེན་པ་དང་སྲིད་པ་དང་སྐྱེ་བ་དང་རྒ་ཤི་མི་རྟག་པ་སྟེ། གང་དང་ཡང་བྲལ་བས་མ་ཡིན་ནོ།
en: Formative predispositions, consciousness, name and form, the six sense fields, sensory contact, sensation, craving, grasping, the rebirth process, actual birth, and aging and death are impermanent, but that is not owing to the disappearance of anything at all. “

source: །སྦྱིན་པའི་ཕ་རོལ་དུ་ཕྱིན་པ་མི་རྟག་པ་སྟེ། གང་དང་ཡང་བྲལ་བས་མ་ཡིན་ནོ།
en: The perfection of generosity is impermanent, but that is not owing to the disappearance of anything at all.

source: །ཚུལ་ཁྲིམས་ཀྱི་ཕ་རོལ་དུ་ཕྱིན་པ་དང་། བཟོད་པའི་ཕ་རོལ་དུ་ཕྱིན་པ་དང་། བརྩོན་འགྲུས་ཀྱི་ཕ་རོལ་དུ་ཕྱིན་པ་དང་། བསམ་གཏན་གྱི་ཕ་རོལ་དུ་ཕྱིན་པ་དང་། ཤེས་རབ་ཀྱི་ཕ་རོལ་དུ་ཕྱིན་པ་མི་རྟག་པ་སྟེ།
en: The perfection of ethical discipline, the perfection of tolerance, the perfection of perseverance, the perfection of meditative concentration, and the perfection of wisdom are impermanent, but that is not owing to the disappearance of anything at all. “

source: གང་དང་ཡང་བྲལ་བས་མ་ཡིན་ནོ། །ནང་སྟོང་པ་ཉིད་མི་རྟག་པ་སྟེ།
en: The emptiness of internal phenomena is impermanent, but that is not owing to the disappearance of anything at all.

source: གང་དང་ཡང་བྲལ་བས་མ་ཡིན་ནོ། །ཕྱི་སྟོང་པ་ཉིད་མི་རྟག་པ་སྟེ།
en: The emptiness of external phenomena is impermanent, but that is not owing to the disappearance of anything at all.

source: གང་དང་ཡང་བྲལ་བས་མ་ཡིན་ནོ། །ཕྱི་ནང་སྟོང་པ་ཉིད་མི་རྟག་པ་སྟེ།
en: The emptiness of external and internal phenomena is impermanent, but that is not owing to the disappearance of anything at all. [

source: གང་དང་ཡང་བྲལ་བས་མ་ཡིན་ནོ། །དངོས་པོ་མེད་པའི་ངོ་བོ་ཉིད་སྟོང་པ་ཉིད་ཀྱི་བར་དུ་མི་རྟག་པ་སྟེ། གང་དང་ཡང་བྲལ་བས་མ་ཡིན་ནོ།
en: The other aspects of emptiness], up to and including the emptiness of the essential nature of nonentities, are impermanent, but that is not owing to the disappearance of anything at all. “

source: །དྲན་པ་ཉེ་བར་གཞག་པ་རྣམས་མི་རྟག་པ་སྟེ། གང་དང་ཡང་བྲལ་བས་མ་ཡིན་ནོ། །ཡང་དག་པར་སྤོང་བ་རྣམས་དང་།
en: The applications of mindfulness are impermanent, but that is not owing to the disappearance of anything at all.

source: རྫུ་འཕྲུལ་གྱི་རྐང་པ་རྣམས་དང་། དབང་པོ་རྣམས་དང་། སྟོབས་རྣམས་དང་། བྱང་ཆུབ་ཀྱི་ཡན་ལག་རྣམས་དང་། འཕགས་པའི་ལམ་ཡན་ལག་བརྒྱད་པ་མི་རྟག་པ་སྟེ། གང་དང་ཡང་བྲལ་བས་མ་ཡིན་ནོ། །འཕགས་པའི་བདེན་པ་རྣམས་དང་། བསམ་གཏན་རྣམས་དང་། ཚད་མེད་པ་རྣམས་དང་། གཟུགས་མེད་པའི་སྙོམས་པར་འཇུག་པ་རྣམས་དང་། རྣམ་པར་ཐར་བ་བརྒྱད་དང་། མཐར་གྱིས་གནས་པའི་སྙོམས་པར་འཇུག་པ་རྣམས་དང་། རྣམ་པར་ཐར་པའི་སྒོ་སྟོང་པ་ཉིད་དང་། མཚན་མ་མེད་པ་དང་། སྨོན་པ་མེད་པ་དང་། མངོན་པར་ཤེས་པ་རྣམས་དང་། ཏིང་ངེ་འཛིན་རྣམས་དང་།
en: The correct exertions, the supports for miraculous ability, the faculties, the powers, the branches of enlightenment, and the noble eightfold path are impermanent, but that is not owing to the disappearance of anything at all. “

source: གཟུངས་ཀྱི་སྒོ་རྣམས་དང་། དེ་བཞིན་གཤེགས་པའི་སྟོབས་བཅུ་དང་། མི་འཇིགས་པ་བཞི་དང་། སོ་སོ་ཡང་དག་པར་རིག་པ་བཞི་དང་། སངས་རྒྱས་ཀྱི་ཆོས་མ་འདྲེས་པ་བཅྭོ་བརྒྱད་མི་རྟག་པ་སྟེ།
en: The truths of the noble ones, the meditative concentrations, the immeasurable attitudes, the formless absorptions, the eight aspects of liberation, the serial steps of meditative absorption, the gateways to liberation—emptiness, signlessness, and wishlessness—the extrasensory powers, the meditative stabilities, the dhāraṇī gateways, the ten powers of the tathāgatas, the four fearlessnesses, the four kinds of exact knowledge, and the eighteen distinct qualities of the buddhas are impermanent, but that is not owing to the disappearance of anything at all.

source: གང་དང་ཡང་བྲལ་བས་མ་ཡིན་ནོ། །དེ་ཅིའི་ཕྱིར་ཞེ་ན། ཚེ་དང་ལྡན་པ་ཤ་ར་དྭ་ཏིའི་བུ་འདི་ལྟར་མི་རྟག་པ་གང་ཡིན་པ་དེ་ནི་དངོས་པོ་མེད་པ་དང་ཟད་པ་སྟེ།
en: If you ask why, Venerable Śāradvatīputra, it is because phenomena that are impermanent are nonentities, and extinct.

source: ཚེ་དང་ལྡན་པ་ཤ་ར་དྭ་ཏིའི་བུ་རྣམ་གྲངས་དེས་ན། ཆོས་ཐམས་ཅད་ནི་མི་རྟག་པ་སྟེ། གང་དང་ཡང་བྲལ་བས་མ་ཡིན་ནོ།
en: That, Venerable Śāradvatīputra, is the formulation explaining how all phenomena are impermanent, but not owing to the disappearance of anything at all. “

source: །ཚེ་དང་ལྡན་པ་ཤ་ར་དྭ་ཏིའི་བུ་གཞན་ཡང་ཆོས་ཐམས་ཅད་ནི་སྡུག་བསྔལ་བ། ཆོས་ཐམས་ཅད་ནི་བདག་མེད་པ། ཆོས་ཐམས་ཅད་ནི་ཞི་བ། ཆོས་ཐམས་ཅད་ནི་སྟོང་པ། ཆོས་ཐམས་ཅད་ནི་མཚན་མ་མེད་པ།
en: Moreover, Venerable Śāradvatīputra, all phenomena are imbued with suffering, all phenomena are without self, all phenomena are at peace, all phenomena are empty, all phenomena are signless, and all phenomena are wishless, but that is not owing to the disappearance of anything at all.

source: ཆོས་ཐམས་ཅད་ནི་སྨོན་པ་མེད་པ་སྟེ། གང་དང་ཡང་བྲལ་བས་མ་ཡིན་ནོ། །དེ་ཅིའི་ཕྱིར་ཞེ་ན། ཚེ་དང་ལྡན་པ་ཤ་ར་དྭ་ཏིའི་བུ་འདི་ལྟར་སྨོན་པ་མེད་པ་གང་ཡིན་པ་དེ་ནི་དངོས་པོ་མེད་པ་དང་ཟད་པ་སྟེ།
en: If you ask why, Venerable Śāradvatīputra, it is because phenomena that are wishless [and so forth] are nonentities, and extinct.

source: ཚེ་དང་ལྡན་པ་ཤ་ར་དྭ་ཏིའི་བུ་རྣམ་གྲངས་དེས་ན། ཆོས་ཐམས་ཅད་ནི་སྨོན་པ་མེད་པ་སྟེ། གང་དང་ཡང་བྲལ་བས་མ་ཡིན་ནོ།
en: That, Venerable Śāradvatīputra, is the formulation explaining how all phenomena are wishless [and so forth], but not owing to the disappearance of anything at all. “

source: །ཚེ་དང་ལྡན་པ་ཤ་ར་དྭ་ཏིའི་བུ་གཞན་ཡང་ཆོས་ཐམས་ཅད་ནི་དགེ་བ། ཆོས་ཐམས་ཅད་ནི་ཁ་ན་མ་ཐོ་བ་མེད་པ། ཆོས་ཐམས་ཅད་ནི་ཟག་པ་མེད་པ། ཆོས་ཐམས་ཅད་ནི་ཉོན་མོངས་པ་མེད་པ། ཆོས་ཐམས་ཅད་ནི་རྣམ་པར་བྱང་བ།
en: Moreover, Venerable Śāradvatīputra, all phenomena are virtuous, all phenomena are without the inadmissible transgressions, all phenomena are uncontaminated, all phenomena are without affliction, all phenomena are pure, all phenomena are supramundane, and all phenomena are unconditioned, but that is not owing to the disappearance of anything at all.

source: ཆོས་ཐམས་ཅད་ནི་འཇིག་རྟེན་ལས་འདས་པ།
en: If you ask why, Venerable Śāradvatīputra, it is because phenomena that are unconditioned [and so forth] are nonentities, and extinct.

source: ཆོས་ཐམས་ཅད་ནི་འདུས་མ་བྱས་པ་སྟེ། གང་དང་ཡང་བྲལ་བས་མ་ཡིན་ནོ། །དེ་ཅིའི་ཕྱིར་ཞེ་ན། ཚེ་དང་ལྡན་པ་ཤ་ར་དྭ་ཏིའི་བུ་འདི་ལྟར་གང་འདུས་མ་བྱས་པ་དེ་ནི་དངོས་པོ་མེད་པ་དང་ཟད་པ་སྟེ།
en: That, Venerable Śāradvatīputra, is the formulation explaining how all phenomena are unconditioned [and so forth], but not owing to the disappearance of anything at all. “

source: ཚེ་དང་ལྡན་པ་ཤ་ར་དྭ་ཏིའི་བུ་རྣམ་གྲངས་དེས་ན། ཆོས་ཐམས་ཅད་ནི་འདུས་མ་བྱས་པ་སྟེ། གང་དང་ཡང་བྲལ་བས་མ་ཡིན་ནོ། །ཚེ་དང་ལྡན་པ་ཤ་ར་དྭ་ཏིའི་བུ་གཞན་ཡང་ཆོས་ཐམས་ཅད་ནི་རྟག་པ་མ་ཡིན་འཇིག་པ་མ་ཡིན་ནོ། །སྨྲས་པ།
en: Moreover, Venerable Śāradvatīputra, all phenomena are not eternal and they are not perishable.” “

source: ཚེ་དང་ལྡན་པ་རབ་འབྱོར་ཅིའི་ཕྱིར། ཆོས་ཐམས་ཅད་རྟག་པ་མ་ཡིན་འཇིག་པ་མ་ཡིན།
en: Venerable Subhūti, why are all phenomena not eternal and why are they not perishable?” {

source: རབ་འབྱོར་གྱིས་སྨྲས་པ། ཚེ་དང་ལྡན་པ་ཤ་ར་དྭ་ཏིའི་བུ་གཟུགས་རྟག་པ་མ་ཡིན་འཇིག་པ་མ་ཡིན་ཏེ།
en: Dt.253} “Venerable Śāradvatīputra,” replied Subhūti, “physical forms are not eternal and they are not perishable.

source: དེ་ཅིའི་ཕྱིར་ཞེ་ན། དེའི་རང་བཞིན་ནི་དེ་ཡིན་ནོ།
en: If you ask why, it is because that is their inherent nature.

source: །ཚོར་བ་དང་འདུ་ཤེས་དང་འདུ་བྱེད་དང་རྣམ་པར་ཤེས་པ་རྟག་པ་མ་ཡིན་འཇིག་པ་མ་ཡིན་ཏེ།
en: Feelings, perceptions, formative predispositions, and consciousness are not eternal and they are not perishable.

source: །ཚེ་དང་ལྡན་པ་ཤ་ར་དྭ་ཏིའི་བུ་མིག་རྟག་པ་མ་ཡིན་འཇིག་པ་མ་ཡིན་ཏེ།
en: Venerable Śāradvatīputra, the eyes are not eternal and they are not perishable.

source: །རྣ་བ་དང་སྣ་དང་ལྕེ་དང་ལུས་དང་ཡིད་རྟག་པ་མ་ཡིན། འཇིག་པ་མ་ཡིན་ཏེ།
en: The ears, the nose, the tongue, the body, and the mental faculty are not eternal and they are not perishable.

source: །ཚེ་དང་ལྡན་པ་ཤ་ར་དྭ་ཏིའི་བུ་གཟུགས་རྟག་པ་མ་ཡིན་འཇིག་པ་མ་ཡིན་ཏེ།
en: Venerable Śāradvatīputra, sights are not eternal and they are not perishable.

source: །སྒྲ་དང་དྲི་དང་རོ་དང་རེག་དང་ཆོས་རྟག་པ་མ་ཡིན་འཇིག་པ་མ་ཡིན་ཏེ།
en: Sounds, odors, tastes, tangibles, and mental phenomena are not eternal and they are not perishable.

source: །ཚེ་དང་ལྡན་པ་ཤ་ར་དྭ་ཏིའི་བུ་མིག་གི་རྣམ་པར་ཤེས་པ་རྟག་པ་མ་ཡིན་འཇིག་པ་མ་ཡིན་ཏེ།
en: Venerable Śāradvatīputra, visual consciousness is not eternal and it is not perishable.

source: དེ་ཅིའི་ཕྱིར་ཞེ་ན། དེའི་རང་བཞིན་ནི་དེ་ཡིན་ནོ། །རྣ་བའི་རྣམ་པར་ཤེས་པ་དང་།
en: If you ask why, it is because that is its inherent nature.

source: སྣའི་རྣམ་པར་ཤེས་པ་དང་། ལྕེའི་རྣམ་པར་ཤེས་པ་དང་། ལུས་ཀྱི་རྣམ་པར་ཤེས་པ་དང་། ཡིད་ཀྱི་རྣམ་པར་ཤེས་པ་རྟག་པ་མ་ཡིན། འཇིག་པ་མ་ཡིན་ཏེ།
en: Auditory consciousness, olfactory consciousness, gustatory consciousness, tactile consciousness, and mental consciousness are not eternal and they are not perishable.

source: །ཚེ་དང་ལྡན་པ་ཤ་ར་དྭ་ཏིའི་བུ་མིག་གི་འདུས་ཏེ་རེག་པ་རྟག་པ་མ་ཡིན། འཇིག་པ་མ་ཡིན་ཏེ།
en: Venerable Śāradvatīputra, visually compounded sensory contact is not eternal and it is not perishable.

source: དེ་ཅིའི་ཕྱིར་ཞེ་ན། དེའི་རང་བཞིན་ནི་དེ་ཡིན་ནོ། །རྣ་བའི་འདུས་ཏེ་རེག་པ་དང་།
en: If you ask why, it is because that is its inherent nature.

source: སྣའི་འདུས་ཏེ་རེག་པ་དང་། ལྕེའི་འདུས་ཏེ་རེག་པ་དང་། ལུས་ཀྱི་འདུས་ཏེ་རེག་པ་དང་། ཡིད་ཀྱི་འདུས་ཏེ་རེག་པ་རྟག་པ་མ་ཡིན། འཇིག་པ་མ་ཡིན་ཏེ།
en: Aurally compounded sensory contact, nasally compounded sensory contact, lingually compounded sensory contact, corporeally compounded sensory contact, and mentally compounded sensory contact are not eternal and they are not perishable.

source: །ཚེ་དང་ལྡན་པ་ཤ་ར་དྭ་ཏིའི་བུ་མིག་གི་འདུས་ཏེ་རེག་པའི་རྐྱེན་གྱིས་ཚོར་བ་རྟག་པ་མ་ཡིན། འཇིག་པ་མ་ཡིན་ཏེ།
en: Venerable Śāradvatīputra, feelings arising from sensory contact that is visually compounded are not eternal and they are not perishable.

source: དེ་ཅིའི་ཕྱིར་ཞེ་ན། དེའི་རང་བཞིན་ནི་དེ་ཡིན་ནོ། །རྣ་བའི་འདུས་ཏེ་རེག་པའི་རྐྱེན་གྱིས་ཚོར་བ་དང་།
en: If you ask why, it is because that is their inherent nature.

source: སྣའི་འདུས་ཏེ་རེག་པའི་རྐྱེན་གྱིས་ཚོར་བ་དང་། ལྕེའི་འདུས་ཏེ་རེག་པའི་རྐྱེན་གྱིས་ཚོར་བ་དང་། ལུས་ཀྱི་འདུས་ཏེ་རེག་པའི་རྐྱེན་གྱིས་ཚོར་བ་དང་། ཡིད་ཀྱི་འདུས་ཏེ་རེག་པའི་རྐྱེན་གྱིས་ཚོར་བ་རྟག་པ་མ་ཡིན། འཇིག་པ་མ་ཡིན་ཏེ།
en: Feelings arising from sensory contact that is aurally compounded, feelings arising from sensory contact that is nasally compounded, feelings arising from sensory contact that is lingually compounded, feelings arising from sensory contact that is corporeally compounded, and feelings arising from sensory contact that is mentally compounded are not eternal and they are not perishable.

source: །ཚེ་དང་ལྡན་པ་ཤ་ར་དྭ་ཏིའི་བུ་སའི་ཁམས་རྟག་པ་མ་ཡིན། འཇིག་པ་མ་ཡིན་ཏེ།
en: Venerable Śāradvatīputra, the earth element is not eternal and it is not perishable.

source: །ཆུའི་ཁམས་དང་། མེའི་ཁམས་དང་། རླུང་གི་ཁམས་དང་། ནམ་མཁའི་ཁམས་དང་། རྣམ་པར་ཤེས་པའི་ཁམས་རྟག་པ་མ་ཡིན།
en: The water element, the fire element, the wind element, the space element, and the consciousness element are not eternal and they are not perishable.
